Repository: KiyaTilahun/refferal_tracking_system_flutter
Catalog: lib/l10n/app_*.arb
Languages: am, es

# loginPageTitle
source: Login
am: የመግቢያ ገጽ
es: Seeni

# refferalid
source: Enter Referral Number Here
am: ሪፈራል ካርድ አስገቡ
es: Lakkoofsa rifaralaa seensisaa

# token
source: Enter token
am: የግል መለያ አስገቡ
es: Mallattoo dhuunfa keessanii galchaa

source: Submit
am: ግባ
es: Seeni

# entervalidtext
source: Please enter some text
am: ልክ ያልሆነ ግቤት
es: Barreeffama tokko galchaa

# smallnumbererror
source: Check Number of Characters
am: ያልተሟላ አገባብ
es: Dogoggora galumsaa!

# scan
source: Scan QR code
am: ምስል ውሰድ
es: koodii QR fudhachuu :

# qrid
source: Referral Id :
am: ሪፈራል ካርድ ፡
es: Kaardii rifaralaa ፡

# qrtoken
source: Token :
am: መለያ ፡
es: Mallattoo dhuunfaa ፡

# loginerror
source: Error: Check Your Card or Token
am: ልክ ያልሆነ ሪፈራል ካርድ ወይም መለያ ፣እንደገና ይሞክሩ
es: Kaardii yookin Mallattoo dhuunfaa keessani irra deebiin ilaalaa

source: Ok
am: እሺ
es: Tole

# qrcode
source: Using QR code
am: QR ኮድ በመጠቀም
es: Koodii QR fayyadamuuf

source: Change Language
am: ቋንቋ ቀይር
es: Afaan Jijjiiri

source: Welcome
am: እንኳን ደህና መጡ
es: Baga nagaan dhuftan

source: Name
am: ስም
es: Maqaa :

# appointementDate
source: Appointement Day :
am: የቀጠሮ ቀን :
es: Guyyaa Beellamaa :

source: Referred By :
am: ከ :
es: irraa:

source: Referred To :
am: ወደ :
es: gara :

source: Completed
am: ተጠናቋል
es: Xumurameera!

source: Pending
am: በመጠባበቅ ላይ
es: Eeggataa kan jiru

source: See More
am: ተጨማሪ
es: Dabalataaf

# detailtitle
source: Referral Detail
am: የሪፈራሉ ዝርዝር መረጃ
es: Wa’ee Rifaralaa ballinaan

source: Profile
am: የግል መረጃዎች
es: Odeeffannoo dhuunfaa

# editapp
source: Edit Appointement
am: ቀጠሮዎን ለማስተካከል
es: Beellama fooyyessuu

# changeapp
source: Change Appointement
am: ቀጠሮዎን
es: Beellama jijjiiruu

source: Update
am: አስተካክል
es: Sirreessi

# appsuccess
source: Appointement changed Sucessfully
am: ቀጠሮዎትን በተሳካ መንገድ ቀይረውታል
es: Beellama milkaa’inaan jijjiirtaniittu!

# apperror
source: Can't change you appointment,try again later
am: ቀጠሮዎትን ማስተካከል አልተቻለም እንደገና ይሞክሩ
es: Beellama jijjiiru hin dandeenye,irra deebi’ii yaala

source: Logout
am: ለመውጣት
es: ba’uuf
